[
  {
    "title": "Inception",
    "rating": "PG-13",
    "date": "2025-03-12",
    "year": "2010",
    "fbombs": "0",
    "clues": {
      "Profanity": "A few occasional uses of 'shit', 'crap' and 'piss'.",
      "Sex": "There is a single kiss in a non-romantic context.",
      "Violence": "A man knocks another man off a snowmobile.",
      "Drugs": "People drink wine and beer. Sedative medications and other mysterious concoctions are required to put people into these dreamlike states.",
      "Intense Scene": "Some concepts in the movie are potentially derealizing."
    }
  },
  {
    "title": "The Matrix",
    "rating": "R",
    "date": "2025-03-13",
    "year": "1999",
    "fbombs": "1",
    "clues": {
      "Profanity": "Several uses of 'shit' and 'damn', one use of 'goddamn'.",
      "Sex": "Brief scene of a man and woman kissing passionately.",
      "Violence": "Multiple intense gunfights and martial arts sequences with characters being shot and hit.",
      "Drugs": "A character takes a red pill which is metaphorical, not a real drug.",
      "Intense Scene": "Scenes of reality-bending and dystopian imagery may be unsettling to some viewers."
    }
  },
  {
    "title": "Titanic",
    "rating": "PG-13",
    "date": "2025-03-14",
    "year": "1997",
    "fbombs": "multiple",
    "clues": {
      "Profanity": "Mild profanity including 'hell' and 'damn'.",
      "Sex": "A brief scene of nudity as a woman poses for a painting, followed by an implied love scene.",
      "Violence": "People struggle to escape as the ship sinks, with some falling to their deaths.",
      "Drugs": "Characters drink wine and champagne during dinner scenes.",
      "Intense Scene": "The sinking sequence is very intense and emotional, with people screaming and drowning."
    }
  },
  {
    "title": "The Shawshank Redemption",
    "rating": "R",
    "year": "1994",
    "date": "2025-03-15",
    "fbombs": "multiple",
    "clues": {
      "Profanity": "Contains strong language, including multiple uses of 'f***' and other expletives.",
      "Sex": "Depicts scenes of sexual violence and implied sexual acts.",
      "Violence": "Includes scenes of physical assault, prison violence, and a graphic depiction of a suicide.",
      "Drugs": "Shows characters consuming alcohol and cigarettes; no depiction of drug use.",
      "Intense Scene": "The portrayal of prison life and instances of abuse may be distressing to some viewers."
    }
  },
  {
    "title": "The Godfather",
    "rating": "R",
    "year": "1972",
    "date": "2025-03-16",
    "fbombs": "few",
    "clues": {
      "Profanity": "Contains some strong language, including uses of 'f***'.",
      "Sex": "Includes brief scenes of sexuality and nudity.",
      "Violence": "Depicts graphic scenes of mob violence, shootings, and assassinations.",
      "Drugs": "Characters are shown drinking alcohol and smoking cigarettes.",
      "Intense Scene": "The depiction of mob executions and intense family drama may be unsettling."
    }
  },
  {
    "title": "The Dark Knight",
    "rating": "PG-13",
    "year": "2008",
    "date": "2025-03-17",
    "fbombs": "none",
    "clues": {
      "Profanity": "Contains mild language, including uses of 'damn' and 'hell'.",
      "Sex": "Minimal sexual content; includes brief kissing scenes.",
      "Violence": "Depicts intense sequences of violence, including shootings, explosions, and hand-to-hand combat.",
      "Drugs": "Some characters are shown drinking alcohol; no drug use depicted.",
      "Intense Scene": "The portrayal of the Joker and intense action sequences may be disturbing to some viewers."
    }
  }
]
