[
  {
    "title": "Inception",
    "rating": "PG-13",
    "date": "2025-10-03",
    "year": "2010",
    "fbombs": "3",
    "clues": {
      "Profanity": "A few occasional uses of 'shit', 'crap' and 'piss'.",
      "Sex": "There is a single kiss in a non-romantic context.",
      "Violence": "A man knocks another man off a snowmobile.",
      "Drugs": "People drink wine and beer. Sedative medications and other mysterious concoctions are required to put people into these dreamlike states.",
      "Intense Scene": "Some concepts in the movie are potentially derealizing."
    }
  },
  {
    "title": "The Matrix",
    "rating": "R",
    "date": "2025-10-04",
    "year": "1999",
    "fbombs": "2",
    "clues": {
      "Profanity": "Several uses of 'shit' and 'damn', one use of 'goddamn'.",
      "Sex": "Brief scene of a man and woman kissing passionately.",
      "Violence": "Multiple intense gunfights and martial arts sequences with characters being shot and hit.",
      "Drugs": "A character takes a red pill which is metaphorical, not a real drug.",
      "Intense Scene": "Scenes of reality-bending and dystopian imagery may be unsettling to some viewers."
    }
  },
  {
    "title": "Titanic",
    "rating": "PG-13",
    "date": "2025-10-05",
    "year": "1997",
    "fbombs": "1",
    "clues": {
      "Profanity": "Mild profanity including 'hell' and 'damn'.",
      "Sex": "A brief scene of nudity as a woman poses for a painting, followed by an implied love scene.",
      "Violence": "People struggle to escape as the ship sinks, with some falling to their deaths.",
      "Drugs": "Characters drink wine and champagne during dinner scenes.",
      "Intense Scene": "The sinking sequence is very intense and emotional, with people screaming and drowning."
    }
  },
  {
    "title": "The Shawshank Redemption",
    "rating": "R",
    "year": "1994",
    "date": "2025-10-06",
    "fbombs": "58",
    "clues": {
      "Profanity": "Contains strong language, including multiple uses of 'f***' and other expletives.",
      "Sex": "Depicts scenes of sexual violence and implied sexual acts.",
      "Violence": "Includes scenes of physical assault, prison violence, and a graphic depiction of a suicide.",
      "Drugs": "Shows characters consuming alcohol and cigarettes; no depiction of drug use.",
      "Intense Scene": "The portrayal of prison life and instances of abuse may be distressing to some viewers."
    }
  },
  {
    "title": "The Godfather",
    "rating": "R",
    "year": "1972",
    "date": "2025-10-07",
    "fbombs": "5",
    "clues": {
      "Profanity": "Contains some strong language, including uses of 'f***'.",
      "Sex": "Includes brief scenes of sexuality and nudity.",
      "Violence": "Depicts graphic scenes of mob violence, shootings, and assassinations.",
      "Drugs": "Characters are shown drinking alcohol and smoking cigarettes.",
      "Intense Scene": "The depiction of mob executions and intense family drama may be unsettling."
    }
  },
  {
    "title": "The Dark Knight",
    "rating": "PG-13",
    "year": "2008",
    "date": "2025-10-08",
    "fbombs": "none",
    "clues": {
      "Profanity": "Contains mild language, including uses of 'damn' and 'hell'.",
      "Sex": "Minimal sexual content; includes brief kissing scenes.",
      "Violence": "Depicts intense sequences of violence, including shootings, explosions, and hand-to-hand combat.",
      "Drugs": "Some characters are shown drinking alcohol; no drug use depicted.",
      "Intense Scene": "The portrayal of the Joker and intense action sequences may be disturbing to some viewers."
    }
  },
  {
    "title": "Forrest Gump",
    "rating": "PG-13",
    "year": "1994",
    "date": "2025-10-09",
    "fbombs": "2",
    "clues": {
      "Profanity": "Two F-words are said along with uses of 'shit', 'damn', 'ass', and 'hell'. A few racial slurs including the n-word.",
      "Sex": "A woman takes off her bra showing her back. A woman is briefly heard moaning. Jenny puts Forrest's hand on her bare breast showing only the side.",
      "Violence": "90% of violence occurs during Vietnam chapter with explosions, gun shots, and dead bodies. Men are seen with bloody wounds. One man has legs amputated.",
      "Drugs": "A woman is shown snorting cocaine very briefly. Bongs, pills, and needles are shown. A man smokes and drinks heavily.",
      "Intense Scene": "Forrest is bullied for wearing leg braces. War scenes with PTSD triggers. A woman nearly commits suicide by jumping from a building."
    }
  },
  {
    "title": "Pulp Fiction",
    "rating": "R",
    "year": "1994",
    "date": "2025-10-10",
    "fbombs": "265",
    "clues": {
      "Profanity": "265 uses of 'f***'. The n-word is used frequently. Many uses of 'shit', 'motherfucker', and 'goddamn'. Pervasive strong language throughout.",
      "Sex": "A man is shown being raped with some buttocks visible. Brief nudity on a dirty magazine. Some sexual discussion and innuendo throughout.",
      "Violence": "Strong graphic violence throughout. Multiple shootings with blood spurts. A character is shot multiple times with visible bloody bullet holes. Intense and disturbing.",
      "Drugs": "A man graphically prepares and injects heroin in extended detail. A woman mistakes heroin for cocaine and overdoses, nearly dying. Frequent cigarette smoking and marijuana use.",
      "Intense Scene": "Violence is darkly comedic but disturbing. Rape scene is intense. Overdose scene is very upsetting. Not for sensitive viewers."
    }
  },
  {
    "title": "Fight Club",
    "rating": "R",
    "year": "1999",
    "date": "2025-10-11",
    "fbombs": "78",
    "clues": {
      "Profanity": "Nearly 70 F-words, many anatomical references, many scatological references. Over a dozen uses of 'shit'. 'Goddamn' said several times.",
      "Sex": "Brief montage of couple having sex. Intense graphic sexual noises from upstairs room. A naked man opens door wearing only yellow glove. References to dildos and condoms.",
      "Violence": "About 15 scenes of bare-fisted boxing with bloody facial cuts, black eyes, bruised faces. Men threaten castration with knife. Car crashes. Very brutal and graphic.",
      "Drugs": "Woman threatens suicide by Xanax overdose. Vodka and beer drinking throughout. Smoking throughout entire movie. Several bar scenes.",
      "Intense Scene": "Whole film is psychologically intense depicting anti-social behavior and urban vandalism. The narrator becomes increasingly insane. Men endure brutal pain in fight club."
    }
  },
  {
    "title": "Interstellar",
    "rating": "PG-13",
    "year": "2014",
    "date": "2025-10-12",
    "fbombs": "2",
    "clues": {
      "Profanity": "Two F-words, one barely heard. Seven uses of 'shit'. One 'son of a bitch'. Six uses of 'ass'. One 'goddammit'.",
      "Sex": "A brief kiss at the last 30 minutes. A character confesses being in love with another. No sex scenes.",
      "Violence": "A character is killed in an explosion with no blood. A man is punched in face. Brief fight on snowy planet with punching and throwing.",
      "Drugs": "Two men drink beer. No drug use depicted.",
      "Intense Scene": "Very emotional video messages between characters. Space scenes are intense. Giant tidal wave scene is intense. Movie can be very emotional and deals with separation from loved ones."
    }
  },
  {
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "rating": "PG-13",
    "year": "2001",
    "date": "2025-10-13",
    "fbombs": "none",
    "clues": {
      "Profanity": "Slang terms like 'bastard', 'bloody', 'damn', 'hell', and 'maggot'. No strong profanity.",
      "Sex": "A man and woman kiss passionately and pledge their love. Male monsters emerging from goo show buttocks subtly in some shots.",
      "Violence": "Epic battle sequences with swordplay. Man removes head of orc with small splash of black blood. Troll shot through mouth with arrows. Man repeatedly shot with arrows.",
      "Drugs": "Hobbits drink ale and some get drunk at a bar. Many characters smoke pipes throughout.",
      "Intense Scene": "Nazgul are scary creatures in black giving bloodcurdling cries. Jump scares with eye of Sauron and loud noises. Galadriel transforms into terrifying version."
    }
  },
  {
    "title": "Goodfellas",
    "rating": "R",
    "year": "1990",
    "date": "2025-10-14",
    "fbombs": "300",
    "clues": {
      "Profanity": "Over 300 uses of 'f***'. Extensive use of profanity throughout including 'shit', 'goddamn', and other strong language.",
      "Sex": "Some sexual content and implied affairs. A woman is shown in lingerie. Brief passionate kissing scenes.",
      "Violence": "Graphic mob violence throughout. Multiple brutal beatings and shootings. A man is stabbed repeatedly. Bodies shown in car trunk.",
      "Drugs": "Extensive cocaine use and dealing. Characters snort cocaine on screen. Heavy alcohol consumption and cigarette smoking throughout.",
      "Intense Scene": "Paranoia sequences are intense. Violence is brutal and realistic. The lifestyle portrayal and its consequences may be disturbing."
    }
  },
  {
    "title": "Se7en",
    "rating": "R",
    "year": "1995",
    "date": "2025-10-15",
    "fbombs": "98",
    "clues": {
      "Profanity": "Strong language throughout including frequent uses of 'f***', 'shit', 'goddamn', and other profanity.",
      "Sex": "Crime scene shows aftermath of forced sexual act with a weapon. Some sexual references in context of crimes.",
      "Violence": "Extremely graphic and disturbing crime scenes. Victims shown in horrific conditions. Sloth victim is particularly disturbing. Final scene is intensely violent.",
      "Drugs": "Some alcohol consumption. Drug paraphernalia shown at crime scenes.",
      "Intense Scene": "Entire film is dark and disturbing. Crime scenes based on seven deadly sins are graphic and disturbing. Ending is extremely intense and emotionally devastating."
    }
  },
  {
    "title": "The Silence of the Lambs",
    "rating": "R",
    "year": "1991",
    "date": "2025-10-16",
    "fbombs": "10",
    "clues": {
      "Profanity": "Moderate use of strong language including 'f***', 'shit', 'damn', and 'hell'.",
      "Sex": "Discussion of sexual violence. References to victims being kidnapped and skinned. No graphic sex scenes but disturbing sexual content.",
      "Violence": "Graphic violence including cannibalism references. Dead bodies shown with skin removed. A prisoner throws bodily fluids. Prison escape is brutal and bloody.",
      "Drugs": "Brief alcohol consumption. Sedatives mentioned in context of kidnapping.",
      "Intense Scene": "Hannibal Lecter is extremely disturbing and manipulative. Victims in basement are terrifying. Night vision sequence is intense. Psychological horror throughout."
    }
  },
  {
    "title": "Saving Private Ryan",
    "rating": "R",
    "year": "1998",
    "date": "2025-10-17",
    "fbombs": "21",
    "clues": {
      "Profanity": "Strong military language throughout including numerous uses of 'f***', 'shit', 'goddamn', and other profanity.",
      "Sex": "Brief discussion of sexual topics among soldiers. No sexual content shown.",
      "Violence": "Extremely graphic and realistic war violence. Opening D-Day scene shows soldiers with limbs blown off, intestines visible, drowning. Blood everywhere. Very brutal throughout.",
      "Drugs": "Soldiers smoke cigarettes. Brief alcohol consumption. Morphine used for medical purposes.",
      "Intense Scene": "Opening 27 minutes is one of most intense war sequences ever filmed. Constant gunfire, explosions, death. Multiple emotional soldier deaths. Very traumatic for PTSD sufferers."
    }
  },
  {
    "title": "Schindler's List",
    "rating": "R",
    "year": "1993",
    "date": "2025-10-18",
    "fbombs": "7",
    "clues": {
      "Profanity": "Some strong language including uses of 'f***' and other profanity, though not excessive given the subject matter.",
      "Sex": "Brief scene of nudity as women are examined. Implied sexual relationship. Kissing scenes.",
      "Violence": "Extremely graphic Holocaust violence. Mass executions shown. Children and elderly killed. Concentration camp brutality. Liquidation of ghetto is horrifying. Bodies piled up.",
      "Drugs": "Alcohol consumed at parties and by Nazi officers. Cigarette smoking throughout.",
      "Intense Scene": "Entire film is emotionally devastating portrayal of Holocaust. Liquidation scene is traumatic. Children hiding. Girl in red coat symbolism. Crematorium smoke. Very disturbing historical content."
    }
  },
  {
    "title": "The Green Mile",
    "rating": "R",
    "year": "1999",
    "date": "2025-10-19",
    "fbombs": "44",
    "clues": {
      "Profanity": "Strong language throughout prison including frequent 'f***', 'shit', 'goddamn', and other profanity.",
      "Sex": "Brief sexual content. A prisoner exposes himself. Discussion of crimes of sexual nature.",
      "Violence": "Graphic electric chair execution scenes. One particularly brutal botched execution with blood and burning. Beatings of prisoners. Murder flashbacks are disturbing.",
      "Drugs": "Guards and prisoners smoke cigarettes. Brief alcohol consumption.",
      "Intense Scene": "Botched execution is extremely disturbing and prolonged. Death row setting is emotionally heavy. Supernatural elements may be frightening. Final execution is very emotional."
    }
  },
  {
    "title": "Star Wars: Episode V - The Empire Strikes Back",
    "rating": "PG",
    "year": "1980",
    "date": "2025-10-20",
    "fbombs": "none",
    "clues": {
      "Profanity": "Mild language including 'hell' and 'damn'. No strong profanity.",
      "Sex": "Romantic kiss between main characters. Flirtation between Han and Leia.",
      "Violence": "Science fiction violence with lightsaber duels. Luke's hand is cut off. Creatures attack on ice planet. Space battles with ships exploding.",
      "Drugs": "Brief alcohol consumption in cloud city. No drug use.",
      "Intense Scene": "Luke's confrontation with Vader and revelation is emotionally intense. Hand amputation may disturb young viewers. Han being frozen in carbonite is frightening."
    }
  },
  {
    "title": "Star Wars: Episode IV - A New Hope",
    "rating": "PG",
    "year": "1977",
    "date": "2025-10-21",
    "fbombs": "none",
    "clues": {
      "Profanity": "Very mild language. A few uses of 'damn' and 'hell'.",
      "Sex": "Brief kiss for luck. Princess Leia in white gown. No sexual content.",
      "Violence": "Science fiction violence with laser guns and lightsabers. Stormtroopers shot. Death Star destroys planet killing billions off-screen. Burned skeletons of Luke's aunt and uncle shown briefly.",
      "Drugs": "Cantina scene shows aliens drinking. Brief alcohol references. No drug use.",
      "Intense Scene": "Death of Obi-Wan may be sad. Trash compactor scene is claustrophobic. Death Star attack is tense. Storm trooper interrogation with torture device implied."
    }
  },
  {
    "title": "Back to the Future",
    "rating": "PG",
    "year": "1985",
    "date": "2025-10-22",
    "fbombs": "none",
    "clues": {
      "Profanity": "Mild language including 'damn', 'hell', 'ass', and 'bastard'. One use of 'shit'.",
      "Sex": "Attempted date rape scene with Biff forcing himself on Lorraine before being stopped. Some sexual tension and kissing. Marty accidentally becomes object of his mother's affection.",
      "Violence": "Biff and gang bully and chase Marty. Fist fights and punching. Car chases. Man shot and appears to die but wearing vest. Libyans chase with guns.",
      "Drugs": "George and Marty drink alcohol. Characters drink at diner. Cigarette smoking in 1950s.",
      "Intense Scene": "Clock tower sequence is very tense with lightning. Marty fading from photograph is disturbing. Being chased by Libyans with guns is intense. Nearly hitting his mother is uncomfortable."
    }
  },
  {
    "title": "Gladiator",
    "rating": "R",
    "year": "2000",
    "date": "2025-10-23",
    "fbombs": "5",
    "clues": {
      "Profanity": "Some strong language including 'bastard' and 'damn'. A few uses of profanity but not excessive.",
      "Sex": "Implied sexual relationship. Concubines shown briefly. Kissing scenes. Some cleavage in Roman costumes.",
      "Violence": "Extremely graphic gladiator violence. Men decapitated, dismembered, stabbed, and killed in arena. Tigers maul people. Opening battle is brutal with limbs severed and blood everywhere.",
      "Drugs": "Wine drinking at feasts. Roman parties show excess. No drug use.",
      "Intense Scene": "Death of Maximus's family shown with hanging and burning. Gladiator fights are brutally intense. Commodus is disturbing and creepy. Final fight is emotionally charged and violent."
    }
  },
  {
    "title": "The Departed",
    "rating": "R",
    "year": "2006",
    "date": "2025-10-24",
    "fbombs": "258",
    "clues": {
      "Profanity": "Over 200 uses of 'f***'. Pervasive strong language throughout including 'shit', 'c***', and every profanity imaginable. Constant swearing.",
      "Sex": "Sex scenes with some nudity and thrusting. Prostitutes shown. Sexual references throughout. Frank makes crude sexual comments.",
      "Violence": "Extremely graphic violence. Multiple headshots with blood splatter. Man's head blown apart. Bodies fall from buildings. Brutal beating with blood. Final sequence is shockingly violent.",
      "Drugs": "Heavy cocaine use and dealing. Characters snort cocaine on screen. Smoking and drinking throughout. Drug trade is central to plot.",
      "Intense Scene": "Constant tension of dual undercover situation. Paranoia is intense. Elevator scene is shockingly violent. Multiple sudden brutal deaths. Rat symbolism throughout."
    }
  },
  {
    "title": "The Prestige",
    "rating": "PG-13",
    "year": "2006",
    "date": "2025-10-25",
    "fbombs": "none",
    "clues": {
      "Profanity": "Mild language including 'bloody', 'damn', and 'hell'. No strong profanity.",
      "Sex": "Brief kissing and implied relationships. Some cleavage in period costumes. Affair mentioned.",
      "Violence": "A woman drowns in water tank which is shown and repeated. Man's fingers shot off. Hanging scene. Bodies electrocuted and drowned in tanks.",
      "Drugs": "Period-appropriate alcohol consumption. Characters drink wine and spirits. Cigarette smoking.",
      "Intense Scene": "Drowning sequences are very disturbing and claustrophobic. Clones being killed is dark. Obsession and sacrifice themes are heavy. Twist ending recontextualizes entire film darkly."
    }
  },
  {
    "title": "Memento",
    "rating": "R",
    "year": "2000",
    "date": "2025-10-26",
    "fbombs": "145",
    "clues": {
      "Profanity": "Strong language throughout including frequent uses of 'f***', 'shit', 'goddamn', and other profanity.",
      "Sex": "Sex scene with partial nudity. Brief breast nudity. Tattoo on naked body shown. Prostitute character.",
      "Violence": "Graphic violence including shooting in mouth with blood. Man strangled. Beatings and blood. Opening murder shown in reverse.",
      "Drugs": "Drug dealing referenced. Alcohol consumption and bar scenes. Character uses drugs to commit crime.",
      "Intense Scene": "Entire non-linear structure is disorienting and confusing intentionally. Memory loss condition is disturbing. Man tattooing himself is intense. Unreliable narrator creates constant tension."
    }
  },
  {
    "title": "The Lion King",
    "rating": "G",
    "year": "1994",
    "date": "2025-10-27",
    "fbombs": "none",
    "clues": {
      "Profanity": "No profanity at all. Completely clean dialogue.",
      "Sex": "None. Brief 'Can You Feel the Love Tonight' romantic sequence between Simba and Nala with nuzzling.",
      "Violence": "Mufasa's death by falling and trampling is intense but not graphic. Scar fights Simba. Hyenas attack. Wildebeest stampede is frightening.",
      "Drugs": "No drug or alcohol use depicted.",
      "Intense Scene": "Mufasa's death scene is very sad and traumatic for children. Simba blames himself. Scar is a frightening villain. Hyenas in elephant graveyard are scary. Fire during final battle."
    }
  },
  {
    "title": "Toy Story",
    "rating": "G",
    "year": "1995",
    "date": "2025-10-28",
    "fbombs": "none",
    "clues": {
      "Profanity": "No profanity. One use of 'idiot'. Completely clean for children.",
      "Sex": "None. Bo Peep flirts mildly with Woody. No sexual content.",
      "Violence": "Toys fight each other. Sid destroys and mutilates toys. Rocket strapped to Buzz. Dog chases toys. All cartoon violence with no blood.",
      "Drugs": "No drug or alcohol use depicted at all.",
      "Intense Scene": "Sid's house and mutant toys may frighten young children. Buzz realizing he's a toy is existentially heavy. Rocket scene is intense. Being lost is scary for children."
    }
  },
  {"title": "Exodus", "date": "2025-10-29"},
  {"title": "Swiss Family Robinson", "date": "2025-10-30"},
  {"title": "G.I. Blues", "date": "2025-10-31"},
  {"title": "The Alamo", "date": "2025-11-01"},
  {"title": "Midnight Lace", "date": "2025-11-02"},
  {"title": "Spartacus", "date": "2025-11-03"},
  {"title": "Elmer Gantry", "date": "2025-11-04"},
  {"title": "Tall Story", "date": "2025-11-05"},
  {"title": "101 Dalmatians", "date": "2025-11-06"},
  {"title": "The Parent Trap", "date": "2025-11-07"},
  {"title": "West Side Story", "date": "2025-11-08"},
  {"title": "Lawrence of Arabia", "date": "2025-11-09"},
  {"title": "How the West Was Won", "date": "2025-11-10"},
  {"title": "Cleopatra", "date": "2025-11-11"},
  {"title": "It's a Mad Mad Mad Mad World", "date": "2025-11-12"},
  {"title": "From Russia With Love", "date": "2025-11-13"},
  {"title": "Mary Poppins", "date": "2025-11-14"},
  {"title": "My Fair Lady", "date": "2025-11-15"},
  {"title": "Goldfinger", "date": "2025-11-16"},
  {"title": "The Sound of Music", "date": "2025-11-17"},
  {"title": "Help!", "date": "2025-11-18"},
  {"title": "Doctor Zhivago", "date": "2025-11-19"},
  {"title": "Bonnie and Clyde", "date": "2025-11-20"},
  {"title": "The Jungle Book", "date": "2025-11-21"},
  {"title": "The Graduate", "date": "2025-11-22"},
  {"title": "Planet of the Apes", "date": "2025-11-23"},
  {"title": "2001: A Space Odyssey", "date": "2025-11-24"},
  {"title": "Yours, Mine and Ours", "date": "2025-11-25"},
  {"title": "The Odd Couple", "date": "2025-11-26"},
  {"title": "Funny Girl", "date": "2025-11-27"},
  {"title": "Romeo and Juliet", "date": "2025-11-28"},
  {"title": "The Love Bug", "date": "2025-11-29"},
  {"title": "Butch Cassidy and the Sundance Kid", "date": "2025-11-30"},
  {"title": "On Her Majesty's Secret Service", "date": "2025-12-01"},
  {"title": "MAS*H", "date": "2025-12-02"},
  {"title": "Airport", "date": "2025-12-03"},
  {"title": "The Aristocats", "date": "2025-12-04"},
  {"title": "Fiddler on the Roof", "date": "2025-12-05"},
  {"title": "Shaft", "date": "2025-12-06"},
  {"title": "Diamonds Are Forever", "date": "2025-12-07"},
  {"title": "A Clockwork Orange", "date": "2025-12-08"},
  {"title": "Dirty Harry", "date": "2025-12-09"},
  {"title": "The Godfather", "date": "2025-12-10"},
  {"title": "Slaughterhouse-Five", "date": "2025-12-11"},
  {"title": "Deep Throat", "date": "2025-12-12"},
  {"title": "Deliverance", "date": "2025-12-13"},
  {"title": "The Poseidon Adventure", "date": "2025-12-14"},
  {"title": "Live and Let Die", "date": "2025-12-15"},
  {"title": "American Graffiti", "date": "2025-12-16"},
  {"title": "The Way We Were", "date": "2025-12-17"},
  {"title": "The Exorcist", "date": "2025-12-18"},
  {"title": "The Sting", "date": "2025-12-19"},
  {"title": "Blazing Saddles", "date": "2025-12-20"},
  {"title": "The Great Gatsby", "date": "2025-12-21"},
  {"title": "The Longest Yard", "date": "2025-12-22"},
  {"title": "The Texas Chainsaw Massacre", "date": "2025-12-23"},
  {"title": "Towering Inferno", "date": "2025-12-24"},
  {"title": "The Godfather: Part II", "date": "2025-12-25"},
  {"title": "Jaws", "date": "2025-12-26"},
  {"title": "The Rocky Horror Picture Show", "date": "2025-12-27"},
  {"title": "One Flew Over the Cuckoo's Nest", "date": "2025-12-28"},
  {"title": "Taxi Driver", "date": "2025-12-29"},
  {"title": "The Bad News Bears", "date": "2025-12-30"},
  {"title": "Rocky", "date": "2025-12-31"},
  {"title": "King Kong", "date": "2026-01-01"},
  {"title": "Silver Streak", "date": "2026-01-02"},
  {"title": "A Star is Born", "date": "2026-01-03"},
  {"title": "Freaky Friday", "date": "2026-01-04"},
  {"title": "Star Wars Ep. IV: A New Hope", "date": "2026-01-05"},
  {"title": "Smokey and the Bandit", "date": "2026-01-06"},
  {"title": "The Deep", "date": "2026-01-07"},
  {"title": "The Spy Who Loved Me", "date": "2026-01-08"},
  {"title": "Close Encounters of the Third Kind", "date": "2026-01-09"},
  {"title": "Saturday Night Fever", "date": "2026-01-10"},
  {"title": "Grease", "date": "2026-01-11"},
  {"title": "Jaws 2", "date": "2026-01-12"},
  {"title": "National Lampoon's Animal House", "date": "2026-01-13"},
  {"title": "Up in Smoke", "date": "2026-01-14"},
  {"title": "Halloween", "date": "2026-01-15"},
  {"title": "Superman", "date": "2026-01-16"},
  {"title": "Every Which Way but Loose", "date": "2026-01-17"},
  {"title": "Dracula", "date": "2026-01-18"},
  {"title": "Dawn of the Dead", "date": "2026-01-19"},
  {"title": "Alien", "date": "2026-01-20"},
  {"title": "Rocky II", "date": "2026-01-21"},
  {"title": "Moonraker", "date": "2026-01-22"},
  {"title": "The Amityville Horror", "date": "2026-01-23"},
  {"title": "Apocalypse Now", "date": "2026-01-24"},
  {"title": "Star Trek: The Motion Picture", "date": "2026-01-25"},
  {"title": "1941", "date": "2026-01-26"},
  {"title": "Kramer vs. Kramer", "date": "2026-01-27"},
  {"title": "Dressed to Kill", "date": "2026-01-28"},
  {"title": "The Final Countdown", "date": "2026-01-29"},
  {"title": "American Gigolo", "date": "2026-01-30"},
  {"title": "Coal Miner's Daughter", "date": "2026-01-31"},
  {"title": "The Shining", "date": "2026-02-01"},
  {"title": "Star Wars Ep. V: The Empire Strikes Back", "date": "2026-02-02"},
  {"title": "Friday the 13th", "date": "2026-02-03"},
  {"title": "Urban Cowboy", "date": "2026-02-04"},
  {"title": "Xanadu", "date": "2026-02-05"},
  {"title": "Smokey and the Bandit II", "date": "2026-02-06"},
  {"title": "Cheech & Chong's Next Movie", "date": "2026-02-07"},
  {"title": "Airplane!", "date": "2026-02-08"},
  {"title": "Stir Crazy", "date": "2026-02-09"},
  {"title": "9 to 5", "date": "2026-02-10"},
  {"title": "Raging Bull", "date": "2026-02-11"},
  {"title": "Private Benjamin", "date": "2026-02-12"},
  {"title": "Ordinary People", "date": "2026-02-13"},
  {"title": "The Four Seasons", "date": "2026-02-14"},
  {"title": "Raiders of the Lost Ark", "date": "2026-02-15"},
  {"title": "Excalibur", "date": "2026-02-16"},
  {"title": "Fort Apache, The Bronx", "date": "2026-02-17"},
  {"title": "For Your Eyes Only", "date": "2026-02-18"},
  {"title": "Stripes", "date": "2026-02-19"},
  {"title": "The Fox and the Hound", "date": "2026-02-20"},
  {"title": "Tarzan, The Ape Man", "date": "2026-02-21"},
  {"title": "The Blues Brothers", "date": "2026-02-22"},
  {"title": "An American Werewolf in London", "date": "2026-02-23"},
  {"title": "Chariots of Fire", "date": "2026-02-24"},
  {"title": "Das Boot", "date": "2026-02-25"},
  {"title": "Porky's", "date": "2026-02-26"},
  {"title": "Terms of Endearment", "date": "2026-02-27"},
  {"title": "Poltergeist", "date": "2026-02-28"},
  {"title": "Splash", "date": "2026-03-01"},
  {"title": "Footloose", "date": "2026-03-02"},
  {"title": "Gremlins", "date": "2026-03-03"},
  {"title": "Ghostbusters", "date": "2026-03-04"},
  {"title": "Down and Out in Beverly Hills", "date": "2026-03-05"},
  {"title": "An Officer and a Gentleman", "date": "2026-03-06"},
  {"title": "This is Spinal Tap", "date": "2026-03-07"},
  {"title": "Like Father Like Son", "date": "2026-03-08"},
  {"title": "Ferris Bueller's Day Off", "date": "2026-03-09"},
  {"title": "Predator", "date": "2026-03-10"},
  {"title": "Full Metal Jacket", "date": "2026-03-11"},
  {"title": "Fatal Attraction", "date": "2026-03-12"},
  {"title": "3 Men and a Baby", "date": "2026-03-13"},
  {"title": "The Princess Bride", "date": "2026-03-14"},
  {"title": "RoboCop", "date": "2026-03-15"},
  {"title": "Dirty Dancing", "date": "2026-03-16"},
  {"title": "The Living Daylights", "date": "2026-03-17"},
  {"title": "Lethal Weapon", "date": "2026-03-18"},
  {"title": "Beverly Hills Cop II", "date": "2026-03-19"},
  {"title": "Top Gun", "date": "2026-03-20"},
  {"title": "Outrageous Fortune", "date": "2026-03-21"},
  {"title": "Platoon", "date": "2026-03-22"},
  {"title": "Aliens", "date": "2026-03-23"},
  {"title": "Stand by Me", "date": "2026-03-24"},
  {"title": "Out of Africa", "date": "2026-03-25"},
  {"title": "Crocodile Dundee", "date": "2026-03-26"},
  {"title": "Godzilla", "date": "2026-03-27"},
  {"title": "The Color Purple", "date": "2026-03-28"},
  {"title": "The NeverEnding Story", "date": "2026-03-29"},
  {"title": "Pee Wee's Big Adventure", "date": "2026-03-30"},
  {"title": "Risky Business", "date": "2026-03-31"},
  {"title": "Back to the Future", "date": "2026-04-01"},
  {"title": "The Goonies", "date": "2026-04-02"},
  {"title": "The Breakfast Club", "date": "2026-04-03"},
  {"title": "Witness", "date": "2026-04-04"},
  {"title": "Beverly Hills Cop", "date": "2026-04-05"},
  {"title": "A Nightmare on Elm Street", "date": "2026-04-06"},
  {"title": "The Terminator", "date": "2026-04-07"},
  {"title": "Amadeus", "date": "2026-04-08"},
  {"title": "Red Dawn", "date": "2026-04-09"},
  {"title": "Revenge of the Nerds", "date": "2026-04-10"},
  {"title": "The Karate Kid", "date": "2026-04-11"},
  {"title": "Romancing the Stone", "date": "2026-04-12"},
  {"title": "Indiana Jones and the Temple of Doom", "date": "2026-04-13"},
  {"title": "Sudden Impact", "date": "2026-04-14"},
  {"title": "Police Academy", "date": "2026-04-15"},
  {"title": "Scarface", "date": "2026-04-16"},
  {"title": "Star Trek II: The Wrath of Khan", "date": "2026-04-17"},
  {"title": "Tootsie", "date": "2026-04-18"},
  {"title": "Flashdance", "date": "2026-04-19"},
  {"title": "A Christmas Story", "date": "2026-04-20"},
  {"title": "E.T. the Extra-Terrestrial", "date": "2026-04-21"},
  {"title": "Staying Alive", "date": "2026-04-22"},
  {"title": "National Lampoon's Vacation", "date": "2026-04-23"},
  {"title": "Blue Thunder", "date": "2026-04-24"},
  {"title": "Star Wars Ep. VI: Return of the Jedi", "date": "2026-04-25"},
  {"title": "The Outsiders", "date": "2026-04-26"},
  {"title": "Bad Boys", "date": "2026-04-27"},
  {"title": "First Blood", "date": "2026-04-28"},
  {"title": "Conan the Barbarian", "date": "2026-04-29"},
  {"title": "Annie", "date": "2026-04-30"},
  {"title": "Heavy Metal", "date": "2026-05-01"},
  {"title": "Die Hard", "date": "2026-05-02"},
  {"title": "Rain Man", "date": "2026-05-03"},
  {"title": "Big", "date": "2026-05-04"},
  {"title": "Who Framed Roger Rabbit", "date": "2026-05-05"},
  {"title": "The Little Mermaid", "date": "2026-05-06"},
  {"title": "Dead Poets Society", "date": "2026-05-07"},
  {"title": "When Harry Met Sally", "date": "2026-05-08"},
  {"title": "Batman", "date": "2026-05-09"},
  {"title": "Dances with Wolves", "date": "2026-05-10"},
  {"title": "Ghost", "date": "2026-05-11"},
  {"title": "Pretty Woman", "date": "2026-05-12"},
  {"title": "Home Alone", "date": "2026-05-13"},
  {"title": "Terminator 2: Judgment Day", "date": "2026-05-14"},
  {"title": "Beauty and the Beast", "date": "2026-05-15"},
  {"title": "Aladdin", "date": "2026-05-16"},
  {"title": "The Bodyguard", "date": "2026-05-17"},
  {"title": "Jurassic Park", "date": "2026-05-18"},
  {"title": "Mrs. Doubtfire", "date": "2026-05-19"},
  {"title": "Speed", "date": "2026-05-20"},
  {"title": "True Lies", "date": "2026-05-21"},
  {"title": "Apollo 13", "date": "2026-05-22"},
  {"title": "Braveheart", "date": "2026-05-23"},
  {"title": "Independence Day", "date": "2026-05-24"},
  {"title": "Twister", "date": "2026-05-25"},
  {
    "title": "Men in Black",
    "rating": "PG-13",
    "date": "2025-10-02",
    "year": "1997",
    "fbombs": "0",
    "clues": {
      "Profanity": "Mild language including uses of 'damn', 'hell', 'ass', and 'son of a bitch'. No strong profanity or F-words.",
      "Sex": "Brief kissing scene. Some mild flirting between characters. Woman in form-fitting dress. No nudity or sexual content.",
      "Violence": "Sci-fi action violence with aliens being shot and exploding into green goo. A man's head explodes revealing an alien inside. Bug creature attacks and consumes people (mostly off-screen). Alien autopsy scene with slimy organs. All violence is comedic and not realistic.",
      "Drugs": "Characters smoke cigarettes. Brief alcohol consumption in background. Coffee drinking throughout.",
      "Intense Scene": "Giant cockroach alien may be scary for younger children. Body horror moments with aliens emerging from human bodies. Tense chase sequences. Pug dog is threatened but unharmed. Earth faces potential destruction."
    }
  },
  {"title": "Armageddon", "date": "2026-05-27"},
  {"title": "The Truman Show", "date": "2026-05-28"},
  {"title": "The Sixth Sense", "date": "2026-05-29"},
  {"title": "American Beauty", "date": "2026-05-30"},
  {"title": "Cast Away", "date": "2026-05-31"},
  {"title": "A Beautiful Mind", "date": "2026-06-01"},
  {"title": "Spider-Man", "date": "2026-06-02"},
  {"title": "Finding Nemo", "date": "2026-06-03"},
  {"title": "The Bourne Identity", "date": "2026-06-04"},
  {"title": "Pirates of the Caribbean: The Curse of the Black Pearl", "date": "2026-06-05"},
  {"title": "The Incredibles", "date": "2026-06-06"},
  {"title": "Shrek", "date": "2026-06-07"},
  {"title": "300", "date": "2026-06-08"},
  {"title": "No Country for Old Men", "date": "2026-06-09"},
  {"title": "There Will Be Blood", "date": "2026-06-10"},
  {"title": "WALL-E", "date": "2026-06-11"},
  {"title": "Slumdog Millionaire", "date": "2026-06-12"},
  {"title": "Avatar", "date": "2026-06-13"},
  {"title": "Up", "date": "2026-06-14"},
  {"title": "The Social Network", "date": "2026-06-15"},
  {"title": "The King's Speech", "date": "2026-06-16"},
  {"title": "Django Unchained", "date": "2026-06-17"},
  {"title": "The Avengers", "date": "2026-06-18"},
  {"title": "Frozen", "date": "2026-06-19"},
  {"title": "The Wolf of Wall Street", "date": "2026-06-20"},
  {"title": "Guardians of the Galaxy", "date": "2026-06-21"},
  {"title": "Mad Max: Fury Road", "date": "2026-06-22"},
  {"title": "Inside Out", "date": "2026-06-23"},
  {"title": "The Revenant", "date": "2026-06-24"},
  {"title": "La La Land", "date": "2026-06-25"},
  {"title": "Get Out", "date": "2026-06-26"},
  {"title": "Wonder Woman", "date": "2026-06-27"},
  {"title": "Dunkirk", "date": "2026-06-28"},
  {"title": "Black Panther", "date": "2026-06-29"},
  {"title": "A Quiet Place", "date": "2026-06-30"},
  {"title": "Avengers: Endgame", "date": "2026-07-01"},
  {"title": "Parasite", "date": "2026-07-02"},
  {"title": "1917", "date": "2026-07-03"},
  {"title": "Joker", "date": "2026-07-04"},
  {"title": "Knives Out", "date": "2026-07-05"},
  {"title": "Dune", "date": "2026-07-06"},
  {"title": "Spider-Man: No Way Home", "date": "2026-07-07"},
  {"title": "Everything Everywhere All at Once", "date": "2026-07-08"},
  {"title": "Top Gun: Maverick", "date": "2026-07-09"},
  {"title": "The Batman", "date": "2026-07-10"},
  {"title": "Oppenheimer", "date": "2026-07-11"},
  {"title": "Barbie", "date": "2026-07-12"},
  {"title": "Poor Things", "date": "2026-07-13"},
  {"title": "The Holdovers", "date": "2026-07-14"},
  {"title": "Dune: Part Two", "date": "2026-07-15"},
  {"title": "Inside Out 2", "date": "2026-07-16"},
  {"title": "Deadpool & Wolverine", "date": "2026-07-17"},
  {"title": "Wicked", "date": "2026-07-18"},
  {"title": "Gladiator II", "date": "2026-07-19"},
  {"title": "The Breakfast Club", "date": "2026-07-20"},
  {"title": "Stand By Me", "date": "2026-07-21"},
  {"title": "Moonstruck", "date": "2026-07-22"},
  {"title": "Working Girl", "date": "2026-07-23"},
  {"title": "Good Morning, Vietnam", "date": "2026-07-24"},
  {"title": "Coming to America", "date": "2026-07-25"},
  {"title": "Beetlejuice", "date": "2026-07-26"},
  {"title": "Field of Dreams", "date": "2026-07-27"},
  {"title": "Steel Magnolias", "date": "2026-07-28"},
  {"title": "Driving Miss Daisy", "date": "2026-07-29"},
  {"title": "Total Recall", "date": "2026-07-30"},
  {"title": "Misery", "date": "2026-07-31"},
  {"title": "Edward Scissorhands", "date": "2026-08-01"},
  {"title": "The Hunt for Red October", "date": "2026-08-02"},
  {"title": "City Slickers", "date": "2026-08-03"},
  {"title": "The Addams Family", "date": "2026-08-04"},
  {"title": "Boyz n the Hood", "date": "2026-08-05"},
  {"title": "JFK", "date": "2026-08-06"},
  {"title": "A Few Good Men", "date": "2026-08-07"},
  {"title": "Basic Instinct", "date": "2026-08-08"},
  {"title": "Wayne's World", "date": "2026-08-09"},
  {"title": "Sister Act", "date": "2026-08-10"},
  {"title": "The Fugitive", "date": "2026-08-11"},
  {"title": "Sleepless in Seattle", "date": "2026-08-12"},
  {"title": "Philadelphia", "date": "2026-08-13"},
  {"title": "The Crow", "date": "2026-08-14"},
  {"title": "The Mask", "date": "2026-08-15"},
  {"title": "Ace Ventura: Pet Detective", "date": "2026-08-16"},
  {"title": "Dumb and Dumber", "date": "2026-08-17"},
  {"title": "Seven", "date": "2026-08-18"},
  {"title": "Clueless", "date": "2026-08-19"},
  {"title": "Toy Story", "date": "2026-08-20"},
  {"title": "Casino"},
  {"title": "Heat"},
  {"title": "The Rock"},
  {"title": "Jerry Maguire"},
  {"title": "Scream"},
  {"title": "Fargo"},
  {"title": "The Fifth Element"},
  {"title": "Good Will Hunting"},
  {"title": "As Good as It Gets"},
  {"title": "L.A. Confidential"},
  {"title": "Life Is Beautiful"},
  {"title": "American History X"},
  {"title": "Shakespeare in Love"},
  {"title": "The Big Lebowski"},
  {"title": "There's Something About Mary"},
  {"title": "American Pie"},
  {"title": "The Blair Witch Project"},
  {"title": "Office Space"}
]